## 相关设置

In [1]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all" # 一个cell显示多输出

import pandas as pd
pd.set_option('display.max_rows', 400) # 设置最大显示400行
pd.set_option('display.max_columns', 400) # 设置最大显示400列

## 读取数据

In [2]:
import pandas as pd
import numpy as np

data = pd.read_csv("adult.csv", sep="\s+", header=None, names=["age","workclass", "fnlwgt", "education", "education_num", "maritial_status",
                                                               "occupation", "relationship", "race", "sex", "capital_gain", "capital_loss",
                                                               "hours_per_week", "native_country", "income"])

## 数据预处理

In [11]:
data = data.dropna(how='all') # 清除全为空的数据
# data.head()

data.loc[data['income'] == '>50K', 'income'] = 1
data.loc[data['income'] == '>50K.', 'income'] = 1
data.loc[data['income'] == '<=50K', 'income'] = 0
data.loc[data['income'] == '<=50K.', 'income'] = 0

data.describe()

,age,workclass,fnlwgt,education,education_num,maritial_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
count,32561,32561,32561,32561,32561,32561,32561,32561,32561,32561,32561,32561,32561,32561,32561
unique,73,9,21648,16,16,7,15,6,5,2,119,92,94,42,2
top,"36,","Private,","203488,","HS-grad,","9,","Married-civ-spouse,","Prof-specialty,","Husband,","White,","Male,","0,","0,","40,","United-States,",0
freq,898,22696,13,10501,10501,14976,4140,13193,27816,21790,29849,31042,15217,29170,24720

## 特征工程有点复杂，时间不太够了